superhero/app/controllers/heros_controller.rb

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
    def set_super_hero
        @super_hero = Hero.find(params[:id])