superhero/app/controllers/heros_controller.rb

SELECT "heros".* FROM "heros"
---
    def index
        @super_heros = Hero.all

INSERT INTO "heros" ("name", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bryce "], ["city", "DC"], ["created_at", "2020-11-02 21:06:42.793127"], ["updated_at", "2020-11-02 21:06:42.793127"]]
---
    def create
        hero = Hero.create(get_params)

UPDATE "heros" SET "name" = ?, "updated_at" = ? WHERE "heros"."id" = ?  [["name", "Captain Archangel Z"], ["updated_at", "2020-11-02 21:15:12.302897"], ["id", 2]]
---
    def update
        hero = @super_hero
        hero.update(get_params)

DELETE FROM "heros" WHERE "heros"."id" = ?  [["id", 21]]
---
    def destroy
        @super_hero.delete

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
    def set_super_hero
        @super_hero = Hero.find(params[:id])