superhero/app/controllers/powers_controller.rb

    def set_power
        @power = Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]