superhero/app/controllers/powers_controller.rb

    def index
        @powers = Power.all
---
SELECT "powers".* FROM "powers"

    def create
        power = Power.create(get_params)
---
INSERT INTO "powers" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Code"], ["description", "Apparently not"], ["created_at", "2020-11-02 20:41:15.972978"], ["updated_at", "2020-11-02 20:41:15.972978"]]

    def update
        @power.update(get_params)
---
UPDATE "powers" SET "title" = ?, "updated_at" = ? WHERE "powers"."id" = ?  [["title", "ZapZap"], ["updated_at", "2020-11-02 21:21:46.021902"], ["id", 15]]

    def destroy
        @power.delete
---
DELETE FROM "powers" WHERE "powers"."id" = ?  [["id", 16]]

    def set_power
        @power = Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]