superhero/app/models/hero.rb

SELECT "powers".* FROM "powers" WHERE "powers"."title" = ? LIMIT ?  [["title", "Vision - Thermal"], ["LIMIT", 1]]
INSERT INTO "hero_powers" ("hero_id", "power_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["hero_id", 1], ["power_id", 9], ["created_at", "2020-11-02 21:01:40.786980"], ["updated_at", "2020-11-02 21:01:40.786980"]]
---
    def add_power(title)
        power = Power.find_by(title: title)
        HeroPower.create(hero_id: self.id, power_id: power.id)