superhero/app/models/super_hero.rb

    def add_power(name)
        power = Power.find_or_create_by(title: name)
        SuperHeroPower.create(hero_id: self.id, power_id: power.id)
---
SELECT "powers".* FROM "powers" WHERE "powers"."title" = ? LIMIT ?  [["title", "Underwater breathing"], ["LIMIT", 1]]
INSERT INTO "hero_powers" ("super_hero_id", "power_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["super_hero_id", 22], ["power_id", 34], ["created_at", "2020-11-02 19:49:51.902288"], ["updated_at", "2020-11-02 19:49:51.902288"]]