superhero/app/views/powers/show.html.erb

<ul>
    <% @power.heros.each do |hero|%>
---
SELECT "heros".* FROM "heros" INNER JOIN "hero_powers" ON "heros"."id" = "hero_powers"."hero_id" WHERE "hero_powers"."power_id" = ?  [["power_id", 1]]