superhero/app/views/heros/power_select.html.erb

SELECT "powers".* FROM "powers"
---
<%= form_for @super_hero do |h| %>
    <%= h.collection_check_boxes :power_ids, Power.all, :id, :title %>