superhero/app/views/heros/show.html.erb

<ul>
    <% @super_hero.powers.each do |power|%>
---
SELECT "powers".* FROM "powers" INNER JOIN "hero_powers" ON "powers"."id" = "hero_powers"."power_id" WHERE "hero_powers"."super_hero_id" = ?  [["super_hero_id", 23]]